n3tk0/ESP32_Logger/node/src/ConfigPortal.cpp
#include "ConfigPortal.h"

// The NODE_SENSOR_* selection decides which pin fields the form shows.
#include "node_config.h"
// The pin table and the "D6 is GPIO12" parser, shared with tests/host.
#include "NodePins.h"

#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <DNSServer.h>
#include <ArduinoJson.h>

// The sync web server is the right shape here: the portal is a handful of
// requests from one phone, it runs only while nothing else is happening, and
// blocking inside a handler costs nothing when there is no sensor loop to
// stall.
static ESP8266WebServer s_http(80);
static DNSServer        s_dns;
static NodeSettings*    s_target = nullptr;
static bool             s_saved  = false;

/// True while the portal is being served on the STA interface — the home LAN —
/// rather than on the node's own access point.
///
/// THE DIFFERENCE IS WHO CAN REACH IT. To open the AP portal you have to be
/// associated with the node's access point, standing next to it, during a
/// window it opens only after repeated WiFi failures. The background portal is
/// on the LAN, for the node's whole uptime, reachable by anything on the
/// network. The same page cannot be safe in both places, so it is not the same
/// page: secrets are rendered on one and blanked on the other.
static bool s_background = false;

/// Handlers are registered once for the life of the process.
///
/// ESP8266WebServer::on() appends to a list and never deduplicates, and
/// portalStartBackground() is called on every transition back to connected —
/// so a node whose router reboots nightly grew three dead handler entries a
/// night, walked on every request, until it ran out of heap.
static bool s_routesBound = false;

/// Basic auth on the background portal, using the credentials the node already
/// holds for the collector.
///
/// Reusing them is not elegant, but the alternative was worse in both
/// directions: a new setting nobody would fill in, or — as shipped — a form on
/// the LAN that anyone could POST to, repointing the node at their own
/// collector and restarting it. The AP portal is not gated, because reaching it
/// already requires the AP's own password.
static bool backgroundAuthOk() {
    if (!s_background) return true;
    const NodeSettings& s = *s_target;
    if (s_http.authenticate(s.basicUser, s.basicPass)) return true;
    s_http.requestAuthentication();
    return false;
}

bool portalButtonHeld() {
    pinMode(PORTAL_TRIGGER_PIN, INPUT_PULLUP);
    // One read can catch a floating pin mid-transition; require the button to
    // still be down after a debounce interval.
    if (digitalRead(PORTAL_TRIGGER_PIN) != LOW) return false;
    delay(50);
    return digitalRead(PORTAL_TRIGGER_PIN) == LOW;
}

// ---------------------------------------------------------------------------
// The pin table lives in NodePins.h, next to the host test that checks it.
// These are the names this file uses it under.
// ---------------------------------------------------------------------------
using NodePins::BOARDS;
using NodePins::BOARD_COUNT;
using NodePins::FACTS;
using NodePins::LABELS;
using NodePins::LABEL_COUNT;
using NodePins::MAX_GPIO;
using NodePins::RISK_NEVER;

// ---------------------------------------------------------------------------
// Chunked output
// ---------------------------------------------------------------------------
//
// The page is now ~14 KB of HTML, CSS and JS. Building that in a String costs
// more than the ESP8266 can spare while WiFi is up — and the old page already
// reserved 4 KB for a much smaller form. Everything is streamed instead: text
// accumulates in a buffer that flushes at a kilobyte, so the page can grow
// without the free heap noticing.
class Chunked {
public:
    void begin() {
        s_http.setContentLength(CONTENT_LENGTH_UNKNOWN);
        s_http.send(200, "text/html", "");
    }
    Chunked& operator+=(const __FlashStringHelper* v) { _b += v; _maybe(); return *this; }
    Chunked& operator+=(const char* v)                { _b += v; _maybe(); return *this; }
    Chunked& operator+=(const String& v)              { _b += v; _maybe(); return *this; }
    Chunked& operator+=(int v)                        { _b += v; _maybe(); return *this; }
    void end() {
        if (_b.length()) s_http.sendContent(_b);
        _b = "";
        s_http.sendContent(String());   // terminates the chunked response
    }
private:
    void _maybe() {
        if (_b.length() >= 1024) { s_http.sendContent(_b); _b = ""; }
    }
    String _b;
};

// ---------------------------------------------------------------------------
// A value going into an HTML attribute has to be escaped. A WiFi passphrase
// containing a double quote is legal and not rare, and without this it would
// break out of the value attribute and silently truncate the field — the kind
// of bug that looks like "the portal corrupts my password".
// ---------------------------------------------------------------------------
static String esc(const char* raw) {
    String out;
    for (const char* p = raw; *p; p++) {
        switch (*p) {
            case '&':  out += F("&amp;");  break;
            case '<':  out += F("&lt;");   break;
            case '>':  out += F("&gt;");   break;
            case '"':  out += F("&quot;"); break;
            case '\'': out += F("&#39;");  break;
            default:   out += *p;          break;
        }
    }
    return out;
}

static void row(Chunked& p, const char* id, const char* label,
                const String& value, const char* type, const char* hint) {
    p += F("<label for=\""); p += id; p += F("\">"); p += label;
    p += F("</label><input id=\""); p += id;
    p += F("\" name=\""); p += id;
    p += F("\" type=\""); p += type;
    p += F("\" value=\""); p += value;
    p += F("\">");
    if (hint && *hint) { p += F("<p class=\"h\">"); p += hint; p += F("</p>"); }
}

/// A pin field: the same input, plus the live resolver underneath it. The
/// `pin` class is what the JS hooks; `data-role` names the wire so the board
/// diagram can badge it.
static void pinRow(Chunked& p, const char* id, const char* label,
                   uint8_t gpio, const char* role, const char* hint) {
    p += F("<label for=\""); p += id; p += F("\">"); p += label;
    p += F("</label><input id=\""); p += id;
    p += F("\" name=\""); p += id;
    p += F("\" class=\"pin\" data-role=\""); p += role;
    p += F("\" type=\"text\" inputmode=\"text\" autocomplete=\"off\" value=\"");
    p += (int)gpio;
    p += F("\"><p class=\"pinout\" id=\"o_"); p += id; p += F("\"></p>");
    if (hint && *hint) { p += F("<p class=\"h\">"); p += hint; p += F("</p>"); }
}

// ---------------------------------------------------------------------------
// The page
// ---------------------------------------------------------------------------
static void handleRoot() {
    if (!backgroundAuthOk()) return;
    const NodeSettings& s = *s_target;

    Chunked p;
    p.begin();

    p += F("<!DOCTYPE html><html><head><meta charset=\"utf-8\">"
           "<meta name=\"viewport\" content=\"width=device-width,initial-scale=1\">"
           "<title>Sensor node setup</title><style>"
           "body{font-family:system-ui,-apple-system,sans-serif;max-width:32rem;"
           "margin:0 auto;padding:1rem;background:#f6f7f9;color:#111}"
           "h1{font-size:1.3rem;margin:0 0 .2rem}"
           "h2{font-size:.8rem;text-transform:uppercase;letter-spacing:.08em;"
           "color:#666;margin:1.2rem 0 .5rem;border-bottom:1px solid #ddd;"
           "padding-bottom:.3rem}"
           "label{display:block;font-weight:600;font-size:.9rem;margin-top:.8rem}"
           "input,select{width:100%;padding:.5rem;font-size:1rem;"
           "border:1px solid #bbb;border-radius:6px;box-sizing:border-box;"
           "background:#fff}"
           ".h{font-size:.8rem;color:#666;margin:.25rem 0 0}"
           "button{margin-top:1.5rem;width:100%;padding:.7rem;font-size:1rem;"
           "font-weight:600;border:0;border-radius:6px;background:#275673;"
           "color:#fff}"
           "button.sec{background:#e3e6ea;color:#243}"
           "button.mini{margin-top:.4rem;width:auto;padding:.35rem .7rem;"
           "font-size:.85rem;background:#e3e6ea;color:#243}"
           ".nav{display:flex;gap:.6rem}"
           ".dots{display:flex;gap:.35rem;margin:.6rem 0 1rem}"
           ".dot{height:4px;flex:1;border-radius:2px;background:#d7dbe0}"
           ".dot.on{background:#275673}"
           ".step{display:none}.step.on{display:block}"
           ".sub{color:#666;font-size:.85rem;margin:.1rem 0 0}"
           ".pinout{font-size:.8rem;margin:.3rem 0 0;font-weight:600}"
           ".ok{color:#166534}.warn{color:#92400e}.bad{color:#b91c1c}"
           ".nets{margin:.5rem 0 0;max-height:11rem;overflow:auto;"
           "border:1px solid #ddd;border-radius:6px;background:#fff}"
           ".net{display:flex;justify-content:space-between;gap:.5rem;"
           "padding:.5rem .6rem;border-bottom:1px solid #eee;cursor:pointer}"
           ".net:last-child{border-bottom:0}"
           ".net b{font-weight:600}.net span{color:#666;font-size:.8rem}"
           ".board{display:flex;gap:.4rem;justify-content:center;margin:.6rem 0;"
           "background:#fff;border:1px solid #ddd;border-radius:10px;"
           "padding:.6rem .4rem}"
           ".col{display:flex;flex-direction:column;gap:.2rem;flex:1}"
           ".col.r{align-items:flex-end}"
           ".pad{font-size:.72rem;font-family:ui-monospace,monospace;"
           "padding:.15rem .35rem;border-radius:4px;border:1px solid #d7dbe0;"
           "background:#f2f4f6;white-space:nowrap}"
           ".pad.free{background:#e7f6ec;border-color:#b7e0c4}"
           ".pad.caution{background:#fdf3e3;border-color:#f0d9a8}"
           ".pad.never{background:#fdeaea;border-color:#f2bcbc;color:#7f1d1d}"
           ".pad.used{outline:2px solid #275673;font-weight:700}"
           ".mid{flex:0 0 4.5rem;background:#31404d;border-radius:6px;"
           "color:#cfd8e0;font-size:.7rem;text-align:center;padding:.4rem .2rem}"
           ".legend{font-size:.72rem;color:#666;text-align:center;margin:.2rem 0 0}"
           ".err{background:#fdeaea;border:1px solid #f2bcbc;color:#7f1d1d;"
           "padding:.5rem .6rem;border-radius:6px;font-size:.85rem;margin:.6rem 0}"
           "</style></head><body>"
           "<h1>Sensor node setup</h1>");

