n3tk0/ESP32_Logger/node/src/ConfigPortal.cpp
    p += F("<p class=\"sub\" id=\"sub\">Step 1 of 4 &middot; Network</p>"
           "<div class=\"dots\"><i class=\"dot on\"></i><i class=\"dot\"></i>"
           "<i class=\"dot\"></i><i class=\"dot\"></i></div>"
           "<form method=\"POST\" action=\"/save\" id=\"f\">");

    // ── Step 1 — the network ────────────────────────────────────────────────
    p += F("<section class=\"step on\" data-step=\"1\"><h2>WiFi</h2>");
    row(p, "ssid", "Network name", esc(s.ssid), "text", "");
    p += F("<button type=\"button\" class=\"mini\" id=\"scan\">Scan for networks"
           "</button><div class=\"nets\" id=\"nets\" style=\"display:none\"></div>"
           "<p class=\"h\" id=\"scanmsg\"></p>");
    // Rendered ONLY on the access-point portal, where seeing it is a
    // convenience for whoever is standing in front of the node and had to know
    // the AP password to get here. On the LAN portal the field is blank and an
    // empty submission keeps what is stored: that page is reachable by
    // everything on the network for as long as the node is up, and putting the
    // home WiFi passphrase in its HTML source would hand it to all of them.
    if (s_background) {
        row(p, "pass", "Password", String(), "password",
            s.pass[0] ? "Leave empty to keep the saved password."
                      : "Required.");
    } else {
        row(p, "pass", "Password", esc(s.pass), "password",
            "<input type=\"checkbox\" style=\"width:auto;display:inline-block;margin-right:5px;vertical-align:middle\" "
            "onclick=\"document.getElementById('pass').type = this.checked ? 'text' : 'password'\">"
            "<span style=\"vertical-align:middle\">Show password</span>");
    }
    p += F("</section>");

    // ── Step 2 — where the readings go ──────────────────────────────────────
    p += F("<section class=\"step\" data-step=\"2\"><h2>Collector</h2>");
    row(p, "host", "IP address", esc(s.host), "text",
        "The ESP32 collector, on THIS network — the node posts to it. "
        "Give it a DHCP reservation on your router.");
    row(p, "port", "Port", String(s.port), "number", "");
    // Same rule as the passphrase: a shared secret, shown where only someone
    // already on the node's own AP can see it, blank on the LAN.
    if (s_background) {
        row(p, "token", "Ingest token", String(), "password",
            s.token[0] ? "Leave empty to keep the saved token."
                       : "Must match INGEST_TOKEN on the collector.");
    } else {
        row(p, "token", "Ingest token", esc(s.token), "text",
            "Must match INGEST_TOKEN on the collector.");
    }
    row(p, "buser", "Basic auth user", esc(s.basicUser), "text",
        "Two jobs, one password: sent to the collector when it was built with "
        "WEB_BASIC_AUTH_ENABLED, AND required to open this page over the LAN. "
        "Leave both empty and the LAN portal does not start at all.");
    row(p, "bpass", "Basic auth password", String(), "password",
        s.basicPass[0] ? "Leave empty to keep the saved password." : "");
    p += F("</section>");

    // ── Step 3 — the board and its pins ─────────────────────────────────────
    p += F("<section class=\"step\" data-step=\"3\"><h2>Board</h2>"
           "<label for=\"board\">Which board is this</label>"
           "<select id=\"board\" name=\"board\">");
    for (uint8_t i = 0; i < BOARD_COUNT; i++) {
        p += F("<option value=\""); p += (int)i; p += F("\"");
        if (s.board == i) p += F(" selected");
        p += F(">"); p += BOARDS[i].name; p += F("</option>");
    }
    p += F("</select>"
           "<div class=\"board\" id=\"diagram\"></div>"
           "<p class=\"legend\">green: free &middot; amber: usable with care "
           "&middot; red: SPI flash, never</p>");

    // Only sensors actually compiled into this build get pin fields. Offering
    // a 1-Wire pin on a build with no DS18B20 driver would be a control that
    // does nothing, which is worse than no control at all.
#if defined(NODE_SENSOR_BMX280) || defined(NODE_SENSOR_BME688) || \
    defined(NODE_SENSOR_BH1750) || defined(NODE_SENSOR_DS18B20) || \
    defined(NODE_SENSOR_PULSE)  || defined(NODE_SENSOR_SDS011)
    p += F("<h2>Sensor pins</h2>"
           "<p class=\"h\">Type either form — <b>D6</b> or <b>12</b>. The line "
           "under each field says which pin that resolves to.</p>");
#endif

#if defined(NODE_SENSOR_BMX280) || defined(NODE_SENSOR_BME688) || \
    defined(NODE_SENSOR_BH1750)
    pinRow(p, "sda", "I2C SDA", s.i2cSda, "SDA",
           "Shared by every I2C sensor on this node.");
    pinRow(p, "scl", "I2C SCL", s.i2cScl, "SCL", "");
#endif
#if defined(NODE_SENSOR_DS18B20)
    pinRow(p, "ow", "1-Wire data", s.oneWirePin, "1-W",
           "Needs a 4.7k pull-up to 3V3.");
#endif
#if defined(NODE_SENSOR_PULSE)
    pinRow(p, "pulse", "Pulse input", s.pulsePin, "PULSE",
           PULSE_MODE_RAIN ? "Rain gauge reed switch, to GND."
                           : "Hall flow sensor signal line.");
#endif
#if defined(NODE_SENSOR_SDS011)
    pinRow(p, "sdsrx", "SDS011 RX", s.sdsRx, "RX",
           "Wire the sensor's TXD here. D0/GPIO16 will not work — it cannot "
           "raise interrupts.");
    pinRow(p, "sdstx", "SDS011 TX", s.sdsTx, "TX", "");
#endif
    p += F("</section>");

    // ── Step 4 — identity, and what the collector listens for ───────────────
    p += F("<section class=\"step\" data-step=\"4\"><h2>This node</h2>");
    row(p, "nodeid", "Node id", esc(s.nodeId), "text",
        "The collector pairs on THIS STRING, not on an address: it must match "
        "the <b>node</b> field of a sensor of type <b>remote</b> there, "
        "exactly, up to 16 characters.");
    row(p, "interval", "Post interval (seconds)",
        String(s.intervalMs / 1000UL), "number", "");
    row(p, "alt", "Altitude (m)", String(s.altitudeM, 1), "number",
        "Used to report sea-level pressure. 0 sends station pressure only.");
    p += F("<h2>Summary</h2><div id=\"sum\" class=\"h\"></div></section>");

    p += F("<div class=\"nav\">"
           "<button type=\"button\" class=\"sec\" id=\"back\">Back</button>"
           "<button type=\"button\" id=\"next\">Next</button>"
           "<button type=\"submit\" id=\"save\" style=\"display:none\">"
           "Save and restart</button></div></form>");

    // ── The tables the page needs, straight from the C++ ones ───────────────
    //
    // Emitted rather than duplicated in JS: the validation that refuses a save
    // and the colours on the diagram have to agree, and the way to guarantee
    // that is to have one table. It is a few hundred bytes on the wire.
    p += F("<script>var RISK={");
    for (uint8_t g = 0; g <= MAX_GPIO; g++) {
        if (g) p += F(",");
        p += (int)g; p += F(":[");
        p += (int)FACTS[g].risk;
        p += F(",\"");
        p += FPSTR(FACTS[g].why);
        p += F("\"]");
    }
    p += F("};var DL={");
    for (uint8_t i = 0; i < LABEL_COUNT; i++) {
        if (i) p += F(",");
        p += F("\""); p += LABELS[i].label; p += F("\":");
        p += (int)LABELS[i].gpio;
    }
    p += F("};var BOARDS=[");
    for (uint8_t i = 0; i < BOARD_COUNT; i++) {
        if (i) p += F(",");
        p += F("{n:\""); p += BOARDS[i].name;
        p += F("\",l:\""); p += BOARDS[i].left;
        p += F("\",r:\""); p += BOARDS[i].right;
        p += F("\"}");
    }
    p += F("];");

    p += F(
      // ── steps ──────────────────────────────────────────────────────────
      "var st=1,MAX=4;"
      "function show(){"
        "var names=['Network','Collector','Board & pins','This node'];"
        "[].forEach.call(document.querySelectorAll('.step'),function(e){"
          "e.classList.toggle('on',+e.dataset.step===st);});"
        "[].forEach.call(document.querySelectorAll('.dot'),function(e,i){"
          "e.classList.toggle('on',i<st);});"
        "document.getElementById('sub').textContent="
          "'Step '+st+' of '+MAX+' \\u00b7 '+names[st-1];"
        "document.getElementById('back').style.visibility=st>1?'visible':'hidden';"
        "document.getElementById('next').style.display=st<MAX?'':'none';"
        "document.getElementById('save').style.display=st<MAX?'none':'';"
        "if(st===4)summary();"
        "window.scrollTo(0,0);}"
      "function need(id,msg){var v=(document.getElementById(id)||{}).value||'';"
        "if(v.trim())return true;alert(msg);return false;}"
      "function stepOk(){"
        "if(st===1)return need('ssid','Pick or type a network name first.');"
        "if(st===2)return need('host','The collector\\u2019s IP address is required.');"
        "if(st===3)return pinsOk();"
        "return true;}"
      "document.getElementById('next').onclick=function(){"
        "if(!stepOk())return;if(st<MAX){st++;show();}};"
      "document.getElementById('back').onclick=function(){"
        "if(st>1){st--;show();}};"
      // ── pins ───────────────────────────────────────────────────────────
      "function dName(g){for(var k in DL){if(DL[k]===g&&k.charAt(0)==='D'"
        "&&k.length===2)return k;}return '';}"
      "function resolve(v){v=(v||'').trim().toUpperCase();if(!v)return -1;"
        "if(DL.hasOwnProperty(v))return DL[v];"
        "if(v.indexOf('GPIO')===0)v=v.slice(4);"
        "if(!/^[0-9]+$/.test(v))return -1;var n=+v;"
        "return (n>=0&&n<=16)?n:-1;}"
      "function pinFields(){return document.querySelectorAll('input.pin');}"
      "function paintPin(el){"
        "var out=document.getElementById('o_'+el.id);if(!out)return -1;"
        "var g=resolve(el.value);"
        "if(g<0){out.className='pinout bad';"
          "out.textContent='not a pin on this chip \\u2014 use D0\\u2013D8 or a GPIO number 0\\u201316';"
          "return -1;}"
        "var r=RISK[g],d=dName(g),tag='GPIO'+g+(d?' ('+d+')':'');"
        "if(r[0]===2){out.className='pinout bad';out.textContent=tag+' \\u2014 '+r[1];}"
        "else if(r[0]===1){out.className='pinout warn';out.textContent=tag+' \\u2014 '+r[1];}"
        "else{out.className='pinout ok';out.textContent=tag+' \\u2014 free';}"
        "return g;}"
      "function pinsOk(){var bad=[];"
        "[].forEach.call(pinFields(),function(el){var g=paintPin(el);"
          "if(g<0||RISK[g][0]===2)bad.push(el.previousElementSibling"
            "?el.previousElementSibling.textContent:el.id);});"
        "if(bad.length){alert('These pins cannot be used: '+bad.join(', ')+"
          "'.\\nRed means the SPI flash bus \\u2014 the node would boot-loop.');"
          "return false;}"
        "var seen={},dup=[];"
        "[].forEach.call(pinFields(),function(el){var g=resolve(el.value);"
          "if(seen[g])dup.push('GPIO'+g);seen[g]=1;});"
        "if(dup.length){return confirm('Two sensors share '+dup.join(', ')+"
          "'. Save anyway?');}"
        "return true;}"
      // ── the board diagram ──────────────────────────────────────────────
      "function pads(names){var used={};"
        "[].forEach.call(pinFields(),function(el){var g=resolve(el.value);"
          "if(g>=0)used[g]=(used[g]?used[g]+'/':'')+el.dataset.role;});"
        "return names.split(',').map(function(n){"
          "var g=DL.hasOwnProperty(n)?DL[n]:(/^GPIO[0-9]+$/.test(n)?+n.slice(4):-1);"
          "var cls='pad',txt=n;"
          "if(g>=0){var r=RISK[g][0];"
            "cls+=r===2?' never':(r===1?' caution':' free');"
            "txt=n+(/^GPIO/.test(n)?'':' \\u00b7 '+g);"
            "if(used[g]){cls+=' used';txt+=' \\u2190 '+used[g];}}"
          "return '<span class=\"'+cls+'\" title=\"'+(g>=0?RISK[g][1]:'')+'\">'"
            "+txt+'</span>';}).join('');}"
      "function diagram(){var b=BOARDS[+document.getElementById('board').value||0];"
        "document.getElementById('diagram').innerHTML="
          "'<div class=\"col\">'+pads(b.l)+'</div>'"
          "+'<div class=\"mid\">'+b.n+'</div>'"
          "+'<div class=\"col r\">'+pads(b.r)+'</div>';}"
      "document.getElementById('board').onchange=diagram;"
      "[].forEach.call(pinFields(),function(el){"
        "el.addEventListener('input',function(){paintPin(el);diagram();});"
        "paintPin(el);});"
      "diagram();"
      // ── network scan ───────────────────────────────────────────────────
      "var tries=0;"
      "function poll(){fetch('/scan').then(function(r){return r.json();})"
        ".then(function(d){"
          "var msg=document.getElementById('scanmsg');"
          "if(d.scanning){if(++tries<15){setTimeout(poll,700);}"
            "else{msg.textContent='Scan timed out.';}return;}"
          "if(d.error){msg.textContent=d.error;return;}"
          "var box=document.getElementById('nets');"
          "if(!d.networks||!d.networks.length){msg.textContent="
            "'No networks found. Type the name by hand.';return;}"
          "msg.textContent='Tap one to use it.';"
          "box.style.display='';"
          "box.innerHTML=d.networks.map(function(n){"
            "return '<div class=\"net\" data-s=\"'+n.ssid.replace(/\"/g,'&quot;')"
              "+'\"><b>'+n.ssid+'</b><span>'+(n.secure?'\\ud83d\\udd12 ':'')"
              "+n.rssi+' dBm</span></div>';}).join('');"
          "[].forEach.call(box.querySelectorAll('.net'),function(e){"
            "e.onclick=function(){document.getElementById('ssid').value=e.dataset.s;"
              "document.getElementById('pass').focus();};});})"
        ".catch(function(){document.getElementById('scanmsg').textContent="
          "'Scan failed.';});}"
      "document.getElementById('scan').onclick=function(){"
        "tries=0;document.getElementById('scanmsg').textContent='Scanning\\u2026';"
        "fetch('/scan_start').then(function(){setTimeout(poll,900);})"
        ".catch(function(){document.getElementById('scanmsg').textContent="
          "'Scan failed to start.';});};"
      // ── summary ────────────────────────────────────────────────────────
      "function summary(){var g=function(i){var e=document.getElementById(i);"
          "return e?e.value:'';};"
        "var rows=[['Network',g('ssid')],['Collector',g('host')+':'+g('port')],"
          "['Node id',g('nodeid')||'(required)'],"
          "['Posts every',g('interval')+' s']];"
        "[].forEach.call(pinFields(),function(el){"
          "var gp=resolve(el.value);"
          "rows.push([el.dataset.role,gp<0?'invalid':'GPIO'+gp"
            "+(dName(gp)?' ('+dName(gp)+')':'')]);});"
        "document.getElementById('sum').innerHTML=rows.map(function(r){"
          "return '<div><b>'+r[0]+':</b> '+String(r[1]).replace(/</g,'&lt;')"
            "+'</div>';}).join('');}"
      "show();"
      "</script></body></html>");

    p.end();
}

// ---------------------------------------------------------------------------
// GET /scan_start, GET /scan — the network picker
// ---------------------------------------------------------------------------
//
// Two endpoints, not one, for the same reason the collector splits them: an
// ESP8266 scan takes two seconds or more, and doing it inside the request
// would hold the only web-server thread the portal has — on the AP, that is
// the phone's own connection timing out. scanNetworks(true) returns
// immediately and /scan reports progress.
static void handleScanStart() {
    if (!backgroundAuthOk()) return;
    // Widen AP → AP_STA so the access point the phone is sitting on stays up
    // while the radio scans. In the background portal the node is already in
    // STA and can scan as it is.
    if (WiFi.getMode() == WIFI_AP) WiFi.mode(WIFI_AP_STA);
    WiFi.scanDelete();
    WiFi.scanNetworks(true);
    s_http.send(200, "text/plain", "OK");
}

static void handleScanResult() {
    if (!backgroundAuthOk()) return;

    JsonDocument doc;
    const int n = WiFi.scanComplete();
    if (n == WIFI_SCAN_RUNNING) {
        doc["scanning"] = true;
    } else if (n == WIFI_SCAN_FAILED) {
        doc["error"] = "Scan failed.";
    } else {
        JsonArray nets = doc["networks"].to<JsonArray>();
        // Twelve is more than any hallway shows on a phone, and the JSON is
        // built in RAM on a part that has little of it.
        for (int i = 0; i < n && i < 12; i++) {
            JsonObject net = nets.add<JsonObject>();
            net["ssid"]   = WiFi.SSID(i);
            net["rssi"]   = WiFi.RSSI(i);
            net["secure"] = WiFi.encryptionType(i) != ENC_TYPE_NONE;
        }
        WiFi.scanDelete();
    }

    String out;
    serializeJson(doc, out);
    s_http.send(200, "application/json", out);
}

// ---------------------------------------------------------------------------
static void refuse(const String& why) {
    String p = F("<!DOCTYPE html><meta charset=\"utf-8\">"
                 "<body style=\"font-family:sans-serif;max-width:32rem;"
                 "margin:2rem auto;padding:1rem\">"
                 "<p style=\"background:#fdeaea;border:1px solid #f2bcbc;"
                 "color:#7f1d1d;padding:.6rem;border-radius:6px\">");
    p += why;
    p += F("</p><p><a href=\"/\">Back to the form</a> &mdash; nothing was saved.</p>");
    s_http.send(400, "text/html", p);
}

static void handleSave() {
    // Checked HERE too, not only on the form. A POST does not have to come from
    // a page this device served, and this is the handler that rewrites the
    // node's collector address and then restarts it.
    if (!backgroundAuthOk()) return;

