n3tk0/ESP32_Logger/node/src/ConfigPortal.cpp
    // Build into a COPY. Writing straight into the caller's settings would
    // leave them corrupted on the validation and write-failure paths below:
    // portalRun() promises to return with `s` unmodified, and a node that
    // fell back to retrying its saved network would instead be running
    // against a half-applied config from RAM until the next power cycle,
    // even though flash still holds a good one.
    NodeSettings s = *s_target;

    auto text = [&](const char* field, char* dst, size_t len) {
        if (!s_http.hasArg(field)) return;
        strncpy(dst, s_http.arg(field).c_str(), len - 1);
        dst[len - 1] = '\0';
    };
    // An empty password field means "keep the saved one", so it must not
    // overwrite. Clearing a password therefore needs an erase, which is the
    // right trade: accidentally blanking WiFi credentials from a phone
    // keyboard is far likelier than deliberately wanting an open network.
    auto secret = [&](const char* field, char* dst, size_t len) {
        if (!s_http.hasArg(field)) return;
        const String v = s_http.arg(field);
        if (v.length() == 0) return;
        strncpy(dst, v.c_str(), len - 1);
        dst[len - 1] = '\0';
    };

    text  ("ssid",   s.ssid,      sizeof(s.ssid));
    // secret(), not text(). The LAN form serves these fields blank, so a plain
    // copy would wipe the passphrase and the token on every save from it. On
    // the AP form the fields arrive pre-filled, so "empty means keep" only
    // costs the ability to blank them there — which an erase already covers,
    // and which is far rarer than clearing a field by accident on a phone.
    secret("pass",   s.pass,      sizeof(s.pass));
    text  ("host",   s.host,      sizeof(s.host));
    secret("token",  s.token,     sizeof(s.token));
    text  ("buser",  s.basicUser, sizeof(s.basicUser));
    secret("bpass",  s.basicPass, sizeof(s.basicPass));
    text  ("nodeid", s.nodeId,    sizeof(s.nodeId));

    if (s_http.hasArg("port")) {
        const long v = s_http.arg("port").toInt();
        s.port = (v > 0 && v <= 65535) ? (uint16_t)v : 80;
    }
    if (s_http.hasArg("interval")) {
        long secs = s_http.arg("interval").toInt();
        // A node posting every second would hit the collector's rate limiter
        // and fill its ingest table with churn; an hour is past the point
        // where a "live" outdoor reading means anything.
        if (secs < 10)   secs = 10;
        if (secs > 3600) secs = 3600;
        s.intervalMs = (uint32_t)secs * 1000UL;
    }
    if (s_http.hasArg("alt")) {
        s.altitudeM = s_http.arg("alt").toFloat();
    }
    if (s_http.hasArg("board")) {
        const long v = s_http.arg("board").toInt();
        if (v >= 0 && v < BOARD_COUNT) s.board = (uint8_t)v;
    }

    // GPIO numbers — the silkscreen accepted as well, and the flash bus
    // refused outright.
    //
    // The refusal is the point of this whole pass. The form used to take any
    // number from 0 to 16 and write it, so "D6" typed as 6 put I2C on the
    // flash clock and the node boot-looped on a watchdog reset with nothing
    // readable on the serial line. There is no wiring that makes GPIO6-11
    // work, so there is no "are you sure" for it either: the save is rejected
    // and the settings on flash stay as they were.
    const char* badField = nullptr;
    int         badPin   = -1;
    auto pin = [&](const char* field, uint8_t& dst) {
        if (badField) return;                      // first refusal wins
        if (!s_http.hasArg(field)) return;
        const int g = NodePins::resolve(s_http.arg(field));
        if (g < 0 || NodePins::riskOf(g) == RISK_NEVER) {
            badField = field;
            badPin   = g;
            return;
        }
        dst = (uint8_t)g;
    };
    pin("sda",   s.i2cSda);
    pin("scl",   s.i2cScl);
    pin("ow",    s.oneWirePin);
    pin("pulse", s.pulsePin);
    pin("sdsrx", s.sdsRx);
    pin("sdstx", s.sdsTx);

    if (badField) {
        String why = F("<b>");
        why += badField;
        why += F("</b>: ");
        if (badPin < 0) {
            why += F("not a pin on this chip. Use a silkscreen label "
                     "(D0&ndash;D8) or a GPIO number from 0 to 16.");
        } else {
            why += F("GPIO");
            why += badPin;
            why += F(" is the ");
            why += FPSTR(FACTS[badPin].why);
            why += F(". Note that <b>D6 is GPIO12</b>, not GPIO6 &mdash; the "
                     "silkscreen and the GPIO numbers are different scales.");
        }
        Serial.printf("[portal] refused %s = \"%s\"\n",
                      badField, s_http.arg(badField).c_str());
        refuse(why);
        return;
    }

    if (!s.isComplete()) {
        s_http.send(400, "text/html",
                    F("<!DOCTYPE html><meta charset=\"utf-8\">"
                      "<p style=\"font-family:sans-serif\">A network name and a "
                      "collector address are both required. "
                      "<a href=\"/\">Back</a></p>"));
        return;
    }

    if (!settingsSave(s)) {
        s_http.send(500, "text/html",
                    F("<!DOCTYPE html><meta charset=\"utf-8\">"
                      "<p style=\"font-family:sans-serif\">Could not write to "
                      "the filesystem. <a href=\"/\">Back</a></p>"));
        return;
    }

    *s_target = s;
    s_http.send(200, "text/html",
                F("<!DOCTYPE html><meta charset=\"utf-8\">"
                  "<p style=\"font-family:sans-serif\">Saved. Restarting &mdash; "
                  "this network will disappear.</p>"));
    s_saved = true;
}

/// Both portals answer the same four routes. Registered once — see
/// s_routesBound above for what re-registering used to cost.
static void bindRoutes() {
    if (s_routesBound) return;
    s_http.on("/", handleRoot);
    s_http.on("/save", HTTP_POST, handleSave);
    s_http.on("/scan_start", handleScanStart);
    s_http.on("/scan", handleScanResult);
    s_http.onNotFound(handleRoot);
    s_routesBound = true;
}

bool portalRun(NodeSettings& s, uint32_t timeoutMs) {
    s_target     = &s;
    s_saved      = false;
    s_background = false;   // the AP portal: secrets shown, no auth gate

    char ap[32];
    // The MAC suffix keeps two nodes in one house apart on the air.
    snprintf(ap, sizeof(ap), "esp-node-%04X",
             (uint16_t)(ESP.getChipId() & 0xFFFF));

    WiFi.mode(WIFI_AP);
    WiFi.softAP(ap, PORTAL_AP_PASS);
    delay(100);

