n3tk0/ESP32_Logger/node/src/ConfigPortal.cpp
    const IPAddress ip = WiFi.softAPIP();
    Serial.printf("[portal] \"%s\" up at http://%s  (pass: %s)\n",
                  ap, ip.toString().c_str(), PORTAL_AP_PASS);
    if (timeoutMs) Serial.printf("[portal] closing in %lu s\n",
                                 (unsigned long)(timeoutMs / 1000));

    // Answer every DNS query with our own address so phones show the
    // "sign in to network" prompt instead of leaving the user to discover
    // 192.168.4.1 on their own.
    s_dns.setErrorReplyCode(DNSReplyCode::NoError);
    s_dns.start(53, "*", ip);

    bindRoutes();
    s_http.begin();

    const uint32_t start = millis();
    while (true) {
        s_dns.processNextRequest();
        s_http.handleClient();

        if (s_saved) break;

        // A timeout is a promise to the node that it will go back to work.
        // Someone standing at the form is evidence that promise should wait —
        // and an associated station is the only signal available here, since
        // softAP is the opposite of that: it is direct evidence a human is
        // present, so the countdown restarts while anyone is connected.
        const bool client = WiFi.softAPgetStationNum() > 0;
        if (timeoutMs && !client && (millis() - start) > timeoutMs) {
            Serial.println("[portal] timed out");
            break;
        }
        delay(5);   // feeds the softAP task; yield() alone starves it here
    }

    if (s_saved) {
        // Let the browser collect the confirmation page before the AP drops.
        const uint32_t until = millis() + 1500;
        while ((int32_t)(millis() - until) < 0) {
            s_http.handleClient();
            delay(5);
        }
    }

    s_http.stop();
    s_dns.stop();
    WiFi.softAPdisconnect(true);
    WiFi.mode(WIFI_OFF);

    return s_saved;
}

bool portalStartBackground(NodeSettings& s) {
    // FAILS CLOSED. Without credentials there is nothing between this form and
    // everything on the network, and the form rewrites the node's collector
    // address and restarts it. Refusing is a feature the user has to turn on by
    // setting a password, which is the right way round; serving it anyway would
    // be a remote-configuration interface nobody asked to expose.
    if (s.basicUser[0] == '\0' || s.basicPass[0] == '\0') {
        Serial.println(F("[portal] background server NOT started: set a basic-auth "
                         "user and password in the setup portal to enable "
                         "configuration over the LAN"));
        return false;
    }

    s_target     = &s;
    s_saved      = false;
    s_background = true;

    bindRoutes();
    s_http.begin();
    Serial.printf("[portal] background configuration server on http://%s/ "
                  "(password protected)\n", WiFi.localIP().toString().c_str());
    return true;
}

void portalHandleClient() {
    s_http.handleClient();
    if (s_saved) {
        // Let the browser collect the confirmation page
        const uint32_t until = millis() + 1500;
        while ((int32_t)(millis() - until) < 0) {
            s_http.handleClient();
            delay(5);
        }
        Serial.println("[portal] Settings saved via background server, restarting");
        ESP.restart();
    }
}
